app/controllers/answers_controller.rb

  def create
    if @exercise.nil? and @answer.nil?
      @exercise = Exercise.find(params[:exercise_id])
      @answer = @exercise.answers.create(answer_params)
---
SELECT  "exercises".* FROM "exercises" WHERE "exercises"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "answers" ("StudentCode", "exercise_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["StudentCode", "p = p.next;"], ["exercise_id", 1], ["created_at", "2018-07-20 19:29:57.987755"], ["updated_at", "2018-07-20 19:29:57.987755"]]

  def destroy
    @exercise = Exercise.find(params[:exercise_id])
    @answer = @exercise.answers.find(params[:id])
    if @answer.trace.nil?
      @answer.destroy
---
SELECT  "exercises".* FROM "exercises" WHERE "exercises"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "answers".* FROM "answers" WHERE "answers"."exercise_id" = ? AND "answers"."id" = ? LIMIT ?  [["exercise_id", 1], ["id", 107], ["LIMIT", 1]]
DELETE FROM "answers" WHERE "answers"."id" = ?  [["id", 107]]
DELETE FROM "traces" WHERE "traces"."id" = ?  [["id", 65]]

  def visualize
    #puts params.inspect
    @exercise = Exercise.find(params[:exercise_id])

    @answer = @exercise.answers.find(params[:id])
---
SELECT  "exercises".* FROM "exercises" WHERE "exercises"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "answers".* FROM "answers" WHERE "answers"."exercise_id" = ? AND "answers"."id" = ? LIMIT ?  [["exercise_id", 1], ["id", 1], ["LIMIT", 1]]

  def solve
    @exercise = Exercise.find_by_exercise_id(params[:exercise_id])
    student_answer = params[:code]
    student_answer = student_answer[student_answer.index('{')+1..student_answer.index('return')-1]
    @answer = Answer.find_by_StudentCode(student_answer)
    if @answer.nil?
      #puts"new one created"
      @answer = @exercise.answers.create(StudentCode: student_answer)
    end
    if @answer.trace.nil?
      #puts"new trace created"
      trace = generate_code_trace(@exercise.code, student_answer)
      @trace = @answer.create_trace(exercise_trace: trace)
---
SELECT  "exercises".* FROM "exercises" WHERE "exercises"."exercise_id" = ? LIMIT ?  [["exercise_id", "JHAVEPOPEx1"], ["LIMIT", 1]]
SELECT  "answers".* FROM "answers" WHERE "answers"."StudentCode" = ? LIMIT ?  [["StudentCode", "\n    p = p.next;\n    "], ["LIMIT", 1]]
INSERT INTO "answers" ("StudentCode", "exercise_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["StudentCode", "\n    Link m;\n    p = p,next;\n    "], ["exercise_id", 1], ["created_at", "2018-01-12 15:35:04.192267"], ["updated_at", "2018-01-12 15:35:04.192267"]]
INSERT INTO "traces" ("exercise_trace", "answer_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)