app/controllers/exercises_controller.rb

SELECT "exercises".* FROM "exercises"
---
  def index
    @exercise = Exercise.all

SELECT  "exercises".* FROM "exercises" WHERE "exercises"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
---
  def show
    @exercise = Exercise.find(params[:id])

SELECT  "exercises".* FROM "exercises" WHERE "exercises"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
---
  def edit
    @exercise = Exercise.find(params[:id])

SELECT  "exercises".* FROM "exercises" WHERE "exercises"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
UPDATE "exercises" SET "exercise_id" = ?, "code" = ?, "updated_at" = ? WHERE "exercises"."id" = ?
---
  def update
    @exercise = Exercise.find(params[:id])
    if @exercise.update(exercise_params)